#   3. Создать текстовый файл (не программно). Построчно записать фамилии сотрудников и величину их
#   окладов (не менее 10 строк). Определить, кто из сотрудников имеет оклад менее 20 тысяч, вывести
#   фамилии этих сотрудников. Выполнить подсчёт средней величины дохода сотрудников.
#        Пример файла:
#            Иванов 23543.12
#            Петров 13749.32
def my_f_3():
    zps = {}
    try:
        with open('doc_5_3.txt', 'r', encoding='utf-8') as file:
            for lin in file:
                zps[lin.split()[0]] = float(lin.split()[1])
        print('Фамилии сотрудников:')
        for name, zp in zps.items():
            if zp < 20000:
                print(name)
        print('_______________________________')
        print(f'Средняя ЗП: ', sum(zps.values()) / len(zps), 'руб.')
    except:
        print('Ошибка!')
my_f_3()

